// Здадание для варианта 3:

// 1 функция. Каждое кратковременное нажатие включает следующий
// светодиод. Следующее нажатие на кнопку, после включения 6-го
// светодиода выключает их все, данный процесс цикличен.

// 2 функция. Каждое удержание в течении 2-х секунд изменяет частоту
// мерцания светодиода в диапазоне 0.4 Гц, 1.1 Гц, 1.9 Гц. Процесс
// цикличен.

// 3 функция. Каждое удержание в течении 4-х секунд изменяет режим
// работы с мерцания на простое свечение и обратно. Соответственно,
// когда режим работы изменён с режима мерцания на режим свечения
// 2-ая функция не активируется.

// Компоненты:
// светодиоды - 6 //  используемые порты: PC11; PD2; PG2; PE2; PC10; PC9;
// кнопка - 1